In [13]:
import pandas as pd
import numpy as np

In [14]:
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv');

In [15]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [16]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [18]:
df.drop(['PassengerId', 'Name', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],axis=1, inplace=True)

In [19]:
df.head(3)

   Survived  Pclass     Sex   Age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0

In [20]:
df.describe()

         Survived      Pclass         Age
count  891.000000  891.000000  714.000000
mean     0.383838    2.308642   29.699118
std      0.486592    0.836071   14.526497
min      0.000000    1.000000    0.420000
25%      0.000000    2.000000   20.125000
50%      0.000000    3.000000   28.000000
75%      1.000000    3.000000   38.000000
max      1.000000    3.000000   80.000000

In [25]:
df.dropna(axis=0, inplace=True)

In [27]:
df.describe()

         Survived      Pclass         Age
count  714.000000  714.000000  714.000000
mean     0.406162    2.236695   29.699118
std      0.491460    0.838250   14.526497
min      0.000000    1.000000    0.420000
25%      0.000000    1.000000   20.125000
50%      0.000000    2.000000   28.000000
75%      1.000000    3.000000   38.000000
max      1.000000    3.000000   80.000000

In [40]:
df.groupby(['Pclass', 'Age']).count()

              Survived  Sex
Pclass Age
1      0.92          1    1
       2.00          1    1
       4.00          1    1
       11.00         1    1
       14.00         1    1
...                ...  ...
3      61.00         1    1
       63.00         1    1
       65.00         1    1
       70.50         1    1
       74.00         1    1

[182 rows x 2 columns]

In [43]:
df.iloc[:10:2, :2]

   Survived  Pclass
0         0       3
2         1       3
4         0       3
7         0       3
9         1       2

In [44]:
df.loc[2:6, 'Age']

2    26.0
3    35.0
4    35.0
6    54.0
Name: Age, dtype: float64